{
  "id": 4,
  "title": "Tech meet and mix",
  "img": "/src/assets/blogpost_images/techmeet.jpg",
  "content": "Reflecting on Tech Meet & Mix 2023: A Night of Innovation and Learning Last night, I had the pleasure of attending Tech Meet & Mix 2023, an event that brought together the tech community for an evening of insightful talks, networking, and inspiration. Held on November 14, 2023, at 18:00 CET, the event featured presentations on two exciting technologies: Flutter and RedwoodJS. Here's a recap of the evening's highlights and my key takeaways from the sessions led by Fré Dumazy and Adam Juran. Flutter: Revolutionizing App Development Speaker: Fré Dumazy (@FresidentDumazy, fre@skystonesapps.com) Fré Dumazy's presentation on Flutter was an eye-opener. As someone who's always been intrigued by the potential of cross-platform development, I found his talk incredibly informative and motivating. Flutter, Google's UI toolkit, has been making waves in the development community, and Fré did an excellent job of explaining why. Key Takeaways: - Runs on Dart: Flutter's use of Dart, a type-safe programming language, allows for compilation to native code for Android, iOS, and JavaScript. This flexibility is a significant advantage for developers looking to streamline their workflows. - Speed: The performance capabilities of Flutter are impressive, supporting 60 fps or even 120 fps on compatible devices. Fré emphasized that without an interpreter, Flutter apps feel just as native as those built with platform-specific technologies. - Productivity: One of the standout features Fré discussed was stateful hot reload. This feature allows developers to see changes instantly without losing the current app state, significantly speeding up the development process. Coupled with comprehensive devtools and documentation, Flutter enhances developer productivity. - Beauty and Control: Flutter offers complete control over the UI, enabling developers to create visually stunning and highly customized interfaces. Fré showcased some beautiful app examples that highlighted this capability. - Open Source and Community: Flutter's open-source nature and its position as the third most contributed-to project on GitHub underscore its popularity and robust community support. - Portability: Perhaps most impressively, Flutter's ability to use the same codebase across multiple platforms, including mobile, web, desktop, and even embedded devices like cars and coffee machines, was a game-changer. The promise of true platform independence was a highlight of the talk. Fré's session left me excited about the possibilities of Flutter and inspired to dive deeper into this versatile toolkit. RedwoodJS: Simplifying Web Development Speaker: Adam Juran The next highlight of the evening was Adam Juran's presentation on RedwoodJS. With over 25 years of experience in web development, Adam brought a wealth of knowledge and enthusiasm to the stage. His talk focused on how RedwoodJS, a full-stack JavaScript framework, is transforming web development. Key Takeaways: - Comprehensive Framework: Unlike libraries, RedwoodJS offers a full-stack solution that includes React, GraphQL, Prisma, TypeScript, Jest, and Storybook out-of-the-box. This integration facilitates rapid application development by providing pre-built tools and best practices.",
  "date": "2021-07-01"
}
