{
  "id": 5,
  "tag": "seminary",
  "title": "Walchain",
  "description": "Exploring Blockchain: A Day of Learning and Inspiration",
  "img": "blogpost_images/walchain.jpg",
  "content": "Exploring Blockchain: A Day of Learning and Inspiration On October 24, I attended the event 'Blockchain: a source of inspiration for cross-border cooperation' held at Budalab in Kortrijk. The day was packed with travel, insightful presentations, and networking opportunities. Here's a recap of my experience. The Journey Begins My day started early with a train ride from my hometown to Lichtervelde, where I met my colleague, Gaetan Vanderberghe. From there, we took another train to Kortrijk. With the event scheduled to start soon, we had about an hour to spare. Arriving at the Venue The event was hosted at Budalab, located at Dam 2a, 8500 Kortrijk, within the Howest University’s Devine program building. The walk from the train station to Budalab took about ten minutes. The building itself was quite artistic and somewhat labyrinthine. Navigating through it was an adventure in itself; we had to take stairs, then an elevator, and traverse what appeared to be a hallway under construction. Despite these obstacles, we found the venue with half an hour to spare, giving us some time to settle in and prepare for the presentation. The Presentation The presentation was conducted in French. Fortunately, the organizers provided headphones with real-time translation to Dutch, making it accessible for everyone. The speakers, Denuys Bornauw and Loic Delhuvynne, delivered an engaging and educational talk on the potential of blockchain technology to foster cross-border cooperation. Key Highlights: - Blockchain Basics: The speakers began with an overview of blockchain technology, explaining its decentralized nature and how it ensures transparency and security in transactions. - Cross-Border Applications: They highlighted several use cases where blockchain could significantly impact cross-border cooperation, including finance, supply chain management, and digital identity verification. - Real-World Examples: The presentation included real-world examples and case studies that demonstrated the practical applications of blockchain in various industries. The session was packed with valuable insights and practical knowledge about blockchain technology. Networking and Departure After the presentation, there was a networking session at the bar, complete with drinks and delicious sandwiches. This was a great opportunity to mingle with fellow attendees and chat with the speakers. We discussed various topics, including different cryptocurrencies and their potential impacts on global markets. Our plan was to catch a train back, but due to some construction work and despite our best efforts to run for it, we missed the train. We ended up taking the next one, arriving back in Lichtervelde. I had a bit of a wait for my connection to Koksijde, which finally departed, getting me home. Reflections Overall, the event was a success. The journey, although eventful, was worth it for the knowledge and connections gained. The presentation by Denuys Bornauw and Loic Delhuvynne was particularly enlightening, offering a fresh perspective on how blockchain technology can transcend borders and foster international collaboration. Despite the minor hiccup with the train schedule, it was an enriching day filled with learning and networking. I look forward to more events like this, where the tech community can come together to explore and discuss groundbreaking technologies.",
  "date": "23 October 2023"
}
